# 11-12-2023
# CSC461 – Assignment4 – NLP
# H. M. ADIL JAVAID
# FA21-BSE-006
# Q1. Compute BoW, TF, IDF, and then TF.IDF values for each term in the following three sentences.
# Q2. Compute the similarity between S1, S2, and S3 using cosine, manhattan, and euclidean distances.

In [238]:
import warnings
warnings.filterwarnings("ignore")

In [239]:
#import lib

from sklearn.feature_extraction.text import CountVectorizer
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.metrics.pairwise import cosine_similarity
from collections import Counter
import pandas as pd
import math
from math import log
from scipy.spatial.distance import cityblock

In [240]:
#Sentences used

S1 = "data science is one of the most important courses in computer science"
S2 ="this is one of the best data science courses"
S3 = "the data scientists perform data analysis"

In [241]:
#combine data

data = [S1, S2, S3]
data

['data science is one of the most important courses in computer science',
 'this is one of the best data science courses',
 'the data scientists perform data analysis']

In [242]:
#create count vector

cv = CountVectorizer()
c_vector = cv.fit_transform(data)

In [243]:
#tokenize the data

c_token = cv.get_feature_names_out()
c_token

array(['analysis', 'best', 'computer', 'courses', 'data', 'important',
       'in', 'is', 'most', 'of', 'one', 'perform', 'science',
       'scientists', 'the', 'this'], dtype=object)

In [244]:
#convert into Bag of word

dataframe = pd.DataFrame(data = c_vector.toarray(), columns= c_token)
dataframe

,analysis,best,computer,courses,data,important,in,is,most,of,one,perform,science,scientists,the,this
0,0,0,1,1,1,1,1,1,1,1,1,0,2,0,1,0
1,0,1,0,1,1,0,0,1,0,1,1,0,1,0,1,1
2,1,0,0,0,2,0,0,0,0,0,0,1,0,1,1,0

In [245]:
# Tokenize the sentence into words

words1 = S1.split()
words2 = S2.split()
words3 = S3.split()

In [246]:
# Calculate term frequency using Counter
tf1 = Counter(words1)
tf2 = Counter(words2)
tf3 = Counter(words3)

In [247]:
# Calculate the total number of words in the sentence

total_words1 = len(tf1)
total_words2 = len(tf2)
total_words3 = len(tf3)
len(tf1)

11

In [248]:
# Calculate TF for each word
tf_dict1 = {word: tf1/total_words1 for word, tf1 in tf1.items()}
tf_dict2 = {word: tf2/total_words2 for word, tf2 in tf2.items()}
tf_dict3 = {word: tf3/total_words3 for word, tf3 in tf3.items()}

In [249]:
df_S1 = pd.DataFrame(list(tf_dict1.items()), columns=['Word', 'TF'])
df_S2 = pd.DataFrame(list(tf_dict2.items()), columns=['Word', 'TF'])
df_S3 = pd.DataFrame(list(tf_dict3.items()), columns=['Word', 'TF'])

In [250]:
#TF OF S1

df_S1

         Word        TF
0        data  0.090909
1     science  0.181818
2          is  0.090909
3         one  0.090909
4          of  0.090909
5         the  0.090909
6        most  0.090909
7   important  0.090909
8     courses  0.090909
9          in  0.090909
10   computer  0.090909

In [251]:
#TF OF S2

df_S2

      Word        TF
0     this  0.111111
1       is  0.111111
2      one  0.111111
3       of  0.111111
4      the  0.111111
5     best  0.111111
6     data  0.111111
7  science  0.111111
8  courses  0.111111

In [252]:
#TF OF S3

df_S3

         Word   TF
0         the  0.2
1        data  0.4
2  scientists  0.2
3     perform  0.2
4    analysis  0.2

In [253]:
sentences = [
    "data science is one of the most important courses in computer science",
    "this is one of the best data science courses",
    "the data scientists perform data analysis"
]

idf_vectorizer = TfidfVectorizer(use_idf=False)
idf_matrix = idf_vectorizer.fit_transform(data)
idf_df = pd.DataFrame(idf_matrix.toarray(), columns=idf_vectorizer.get_feature_names_out())
idf_df

,analysis,best,computer,courses,data,important,in,is,most,of,one,perform,science,scientists,the,this
0,0.000000,0.000000,0.267261,0.267261,0.267261,0.267261,0.267261,0.267261,0.267261,0.267261,0.267261,0.000000,0.534522,0.000000,0.267261,0.000000
1,0.000000,0.333333,0.000000,0.333333,0.333333,0.000000,0.000000,0.333333,0.000000,0.333333,0.333333,0.000000,0.333333,0.000000,0.333333,0.333333
2,0.353553,0.000000,0.000000,0.000000,0.707107,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.353553,0.000000,0.353553,0.353553,0.000000

In [254]:
tfidf_vect = TfidfVectorizer()
t_tfidf_matrix = tfidf_vect.fit_transform(sentences)

In [255]:
t_tokens = tfidf_vect.get_feature_names_out()

In [256]:
#TFIDF

df = pd.DataFrame(data = t_tfidf_matrix.toarray(), columns = t_tokens)
df

,analysis,best,computer,courses,data,important,in,is,most,of,one,perform,science,scientists,the,this
0,0.000000,0.000000,0.327476,0.249054,0.193412,0.327476,0.327476,0.249054,0.327476,0.249054,0.249054,0.000000,0.498107,0.000000,0.193412,0.000000
1,0.000000,0.422968,0.000000,0.321678,0.249812,0.000000,0.000000,0.321678,0.000000,0.321678,0.321678,0.000000,0.321678,0.000000,0.249812,0.422968
2,0.459115,0.000000,0.000000,0.000000,0.542321,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.459115,0.000000,0.459115,0.271161,0.000000

In [265]:
t_cosine_similarity_matrix = cosine_similarity(dataframe)

In [266]:
#TFIDF Cosine

df_t_similarity = pd.DataFrame(data = t_cosine_similarity_matrix)
df_t_similarity

          0         1         2
0  1.000000  0.712697  0.283473
1  0.712697  1.000000  0.353553
2  0.283473  0.353553  1.000000

In [267]:
#S1 to S2 Manhattan

cityblock(dataframe.iloc[0], dataframe.iloc[1])

7

In [268]:
#S1 to S3 Manhattan

cityblock(dataframe.iloc[0], dataframe.iloc[2])

14

In [269]:
#S2 to S3 Manhattan

cityblock(dataframe.iloc[1], dataframe.iloc[2])

11

In [270]:
#S1 to S2 Euclidean Distance

math.dist(dataframe.iloc[0], dataframe.iloc[1])

2.6457513110645907

In [271]:
#S1 to S3 Euclidean Distance

math.dist(dataframe.iloc[0], dataframe.iloc[2])

4.0

In [272]:
#S2 to S3 Euclidean Distance

math.dist(dataframe.iloc[1], dataframe.iloc[2])

3.3166247903554